Autodesk.Revit.DB.RoofType.ThermalProperties
The calculated and settable thermal properties of the RoofType
Remarks:
Returns null if the roof has no thermal properties.
Curtain roofs do not store thermal properties.
Since:
2013

Autodesk.Revit.DB.RoofType
Represents a specific type of roof.
Remarks:
All roof type objects available in the project can be retrieved from the Document object
via the RoofTypes property. Every Roof object has a RoofType property that returns a
RoofType object representing the type. This same RoofType property can also be used to
change the type of the roof by setting it to a different type.